tutorials/multicomponentFluid/smallPoolFire3D/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;

LES
{
    model          kEqn;

    delta          cubeRootVol;

    turbulence      on;



    kEqn
    {
        ck      0.07;
    }

    cubeRootVol
    {
        deltaCoeff      1;
    }

    Prandtl
    {
        delta           cubeRootVol;
        cubeRootVol
        {
            deltaCoeff      1;
        }
        smooth
        {
            delta           cubeRootVol;
            cubeRootVol
            {
                deltaCoeff      1;
            }
            maxDeltaRatio   1.1;
        }
        Cdelta           0.158;
    }

    vanDriest
    {
        delta           cubeRootVol;
        cubeRootVol
        {
            deltaCoeff      1;
        }
        smooth
        {
            delta           cubeRootVol;
            cubeRootVol
            {
                deltaCoeff      1;
            }
            maxDeltaRatio   1.1;
        }
        Aplus            26;
        Cdelta           0.158;
    }

    smooth
    {
        delta           cubeRootVol;
        cubeRootVol
        {
            deltaCoeff      1;
        }
        maxDeltaRatio   1.1;
    }
}


// ************************************************************************* //
