tutorials/multicomponentFluid/smallPoolFire3D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [pressure];

internalField   uniform 101325;

boundaryField
{
    "(outlet|sides)"
    {
        type            calculated;
        value           $internalField;
    }

    base
    {
        type            calculated;
        value           $internalField;
    }

    inlet
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
